# Code Assignment 2.1

#### By Matthew Stange and started on March 9th, 2023

This my second attempt, but this time with the program in the G2MAssignment folder.

This is my second attempt at using Jupyter Notebook to complete the Cab Assignment for the Data Glacier Internship. I am using '[How to Use Jupyter Notebook: A Beginner's Tutorial](https://www.dataquest.io/blog/jupyter-notebook-tutorial/)' as a guide.

In [4]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df = pd.read_csv('Cab_Data.csv')

In [6]:
df.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

The above is a test to see if the data is accessible, which it appears to be. I have this in a folder that contains all of the CSV fils that are needed for this project. I thought I was using a notebook before, but it must be something else as it wasn't allowing me to access the other files in the folder. Glad to see it working now.

Also to note, knowing keyboard shortcuts is very handy when using Jupyter notebooks and some useful ones are
* ESC takes you out of an active cell, which you need to be out of to do a command on the cell
* Enter puts you into an active cell
* 'a' inserts a new cell 'a'bove the selected cell
* 'b' inserts a new cell 'b'elow the selected cell
* The up and down arrows change which cell is selected
* 'm' designates a cell to be markdown
* 'v' designates the cell to be code
* '# ' in markdown gives a main header, and more #'s reduces the size of the header

This are all of the useful shortcuts I know so far, but they are very handy to know.

Oh! And '*' creates lists and numbers creates numbered lists

---

Next, putting the data from our CSV files in a database seems like the best next move. Databases allow for easy manipulation of the data and it is also a way to store information, which is what we would want to do if this was actual data coming in to our business and we want to be able to access that information.

First, we need to setup a SQL server to store our data and from where we can query from. To do this, I am refering to a [Medium](https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc) article that shows how to setup a SQL server and access that from Jupyter Notebook, or that's what it seems like it is doing. However, that only allows for the data to be inputted manually and accessed, there's no instructions on how to automate the process for a CSV file. This is where an article from [Data to Fish](https://datatofish.com/import-csv-sql-server-python/) comes in to show how Python can automate the process.

In [7]:
# Connecting Python to SQL server

!pip install ipython-sql
%load_ext sql
%sql sqlite://

Requirement already satisfied: ipython-sql in c:\users\dave\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: six in c:\users\dave\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\dave\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\dave\anaconda3\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: sqlparse in c:\users\dave\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: ipython in c:\users\dave\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\dave\anaconda3\lib\site-packages (from ipython-sql) (2.0.5.post1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\dave\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dave\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: pickleshare in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: colorama in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: pygments in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: jedi>=0.16 in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: backcall in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\dave\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: wcwidth in c:\users\dave\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\dave\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)

In [8]:
%%sql
CREATE TABLE sales
(
    key   varchar(6)
);
INSERT INTO sales
VALUES ('sale_1'),
    ('sale_2'),
    ('sale_3');

 * sqlite://
Done.
3 rows affected.

[]

In [9]:
%%sql
select * from sales;

 * sqlite://
Done.

[('sale_1',), ('sale_2',), ('sale_3',)]

EUREKA! It worked!

hrhr, I mean, of course it worked. Now, on to automatically importing our CSV files into appropriate tables. (In case you are unclear on what the 'sales' table is for, I just wanted to perform a test to see if it works as expected using the example that article gave, minus a bit of data. Now that it works, I'll keep this up to show that it works, but really it is of no use and can be deleted.)

In [16]:
%%sql
DROP TABLE sales;

 * sqlite://
Done.

[]

Creating a new table wasn't working, so I decided to DROP, which I understand is similar to deleting, the 'sales' table.

In [11]:
# Import CSV
CabData = pd.read_csv('Cab_Data.csv')
df1 = pd.DataFrame(CabData)

print(df1)

        Transaction ID  Date of Travel     Company           City  \
0             10000011           42377    Pink Cab     ATLANTA GA
1             10000012           42375    Pink Cab     ATLANTA GA
2             10000013           42371    Pink Cab     ATLANTA GA
3             10000014           42376    Pink Cab     ATLANTA GA
4             10000015           42372    Pink Cab     ATLANTA GA
...                ...             ...         ...            ...
359387        10440101           43108  Yellow Cab  WASHINGTON DC
359388        10440104           43104  Yellow Cab  WASHINGTON DC
359389        10440105           43105  Yellow Cab  WASHINGTON DC
359390        10440106           43105  Yellow Cab  WASHINGTON DC
359391        10440107           43102  Yellow Cab  WASHINGTON DC

        KM Travelled  Price Charged  Cost of Trip
0              30.45         370.95      313.6350
1              28.62         358.52      334.8540
2               9.04         125.20       97.6320
3              33.17         377.40      351.6020
4               8.73         114.62       97.7760
...              ...            ...           ...
359387          4.80          69.24       63.3600
359388          8.40         113.75      106.8480
359389         27.75         437.07      349.6500
359390          8.80         146.19      114.0480
359391         12.76         191.58      177.6192

[359392 rows x 7 columns]

In [18]:
# Create Table
%%sql
CREATE TABLE cab_data 
(
    Transaction_ID SMALLINT(8),
    Date_of_Travel DATE,
    Company VARCHAR(20),
    City VARCHAR(50),
    KM_Travelled FLOAT(6,2),
    Price_Charged FLOAT(8,2),
    Cost_of_Trip FLOAT(8,2));

SyntaxError: invalid syntax (195163878.py, line 3)

Cannot figure out what's wrong with the syntax, so I copied the CREATE TABLE part when I created the sales table.

In [19]:
%%sql
CREATE TABLE cab_data
(
    Company   varchar(20)
);

 * sqlite://
Done.

[]

This seems to have worked, now I am going to drop and then recreate the cab_data table, but this time start with the Transaction ID instead of the company. (I did Company in the above table because that had the same data type as the 'sales' table and I thought I should stick with like data types. Also, I forgot that adding columns is going to put the Company column first, which I don't want and I don't want to spend the time figuring out how to fix it, though I realize it is probably an easy fix.)

In [20]:
%%sql
DROP TABLE cab_data;

 * sqlite://
Done.

[]

In [21]:
%%sql
SELECT * FROM cab_data

 * sqlite://
(sqlite3.OperationalError) no such table: cab_data
[SQL: SELECT * FROM cab_data]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [22]:
%%sql
CREATE TABLE Cab_Data
(
    Transaction_ID SMALLINT(8)
);

 * sqlite://
Done.

[]

In [28]:
%%sql
ALTER TABLE Cab_Data
ADD Date_of_Travel DATE;

 * sqlite://
Done.

[]

In [30]:
%%sql
ALTER TABLE Cab_Data
ADD Company VARCHAR(20);

 * sqlite://
Done.

[]

In [33]:
%%sql
ALTER TABLE Cab_Data
ADD City VARCHAR(50);
ALTER TABLE Cab_Data
ADD KM_Travelled FLOAT(6,2);

 * sqlite://
Done.
Done.

[]

In [36]:
%%sql
ALTER TABLE Cab_Data
ADD Cost_of_Trip FLOAT(8,2);

 * sqlite://
Done.

[]

In [37]:
%%sql
SELECT * FROM Cab_Data;

 * sqlite://
Done.

[]

Now the table is setup, so all that needs to be done is import the data from the CSV files.

Trying something else: (from [here](https://stackoverflow.com/questions/36431213/sql-statement-for-csv-files-on-ipython-notebook))

In [49]:
import sqlite3

conn = sqlite3.connect("Cab_Assignment.db")
df1.to_sql('Cab_Data_3', conn)
sql_string = 'SELECT * FROM Cab_Data_3'
df = pd.read_sql(sql_string, conn)

In [50]:
%%sql
SELECT * FROM Cab_Data_3;

 * sqlite://
(sqlite3.OperationalError) no such table: Cab_Data_3
[SQL: SELECT * FROM Cab_Data_3;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Didn't seem to work. Back to the first option.

In [52]:
%%sql
SELECT * FROM Cab_Data.csv;

 * sqlite://
(sqlite3.OperationalError) no such table: Cab_Data.csv
[SQL: SELECT * FROM Cab_Data.csv;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

I am going to give up now and start again at a later time as I think my brain is fried.